<a href="https://colab.research.google.com/github/babsontimie/mypythonlearn/blob/main/PandasHandsOn.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Given a sample list, tuple and a set with elements from 1-10. Convert each of the data types into a pandas series. Create a seperate list of index values for the series

In [ ]:
li = [1,2,3,4,5,6,7,8,9,10]
tup = (1,2,3,4,5,6,7,8,9,10)
se = {13,2,3,44,5,6,77,8,9,10}
print("LIST:",li)
print("TUPLE:",tup)
print("SET:",se)

LIST: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
TUPLE: (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
SET: {2, 3, 5, 6, 8, 9, 10, 44, 13, 77}

In [ ]:
import pandas as pd
#Converting my list into a series
ser_li = pd.Series(li)
ser_li

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [ ]:
#Converting tuple into a series
ser_tuple = pd.Series(tup)
ser_tuple

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [ ]:
#Converting my set into a Series
# ser_set = pd.Series(se)   Throws error
# ser_set
#I cannot directly convert my set into a series because sets are unordered.
#I will convert my set into a list then convert into a series
ser_set = pd.Series(list(se))
ser_set

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [ ]:
#Let's give our own index to series
own_index = ['A','B','C','D','E','F','G','H','I','J']
ser_li = pd.Series(li,index=own_index)
ser_li

A     1
B     2
C     3
D     4
E     5
F     6
G     7
H     8
I     9
J    10
dtype: int64

Create a python dictionary with 5 key value pairs,
Keep the key as name and value as the hobbies. Convert this dictionary into a pandas Series

In [ ]:
di = {
    'Ashwin':'Chess',
    'Riya':'Dance',
    'Akhil':'Singing',
    'Kabir':'Nothing',
    'Ujjwal':'Teaching'
}

In [ ]:
di

{'Ashwin': 'Chess',
 'Riya': 'Dance',
 'Akhil': 'Singing',
 'Kabir': 'Nothing',
 'Ujjwal': 'Teaching'}

In [ ]:
ser_dict = pd.Series(di)

In [ ]:
ser_dict   #When I try to convert my dictionary into a series
           #Keys become my indexes

Ashwin       Chess
Riya         Dance
Akhil      Singing
Kabir      Nothing
Ujjwal    Teaching
dtype: object

Create a pandas series as numbers from 51-60. Then you have to convert this series into a list,tuple and set

In [ ]:
# 09:15

In [ ]:
se = pd.Series([51,52,53,54,55,56,57,58,59,60])
se

0    51
1    52
2    53
3    54
4    55
5    56
6    57
7    58
8    59
9    60
dtype: int64

In [ ]:
#Converting my series into a list
new_li = list(se)
new_li

[51, 52, 53, 54, 55, 56, 57, 58, 59, 60]

In [ ]:
#Convert our series into a tuple
new_tup = tuple(se)
new_tup

(51, 52, 53, 54, 55, 56, 57, 58, 59, 60)

In [ ]:
#Convert our series into a set
new_set = set(se)
new_set

#I can convert my series into a set but viceversa is not possible

{51, 52, 53, 54, 55, 56, 57, 58, 59, 60}

Create a sample series with 10 elements.
Print the first 5 rows
Print the last 5 rows
Insert the value at 200 at index 5
Update the last element of your series with value 120
Delete the first element from your series

In [ ]:
se

0    51
1    52
2    53
3    54
4    55
5    56
6    57
7    58
8    59
9    60
dtype: int64

In [ ]:
#Printing the first 5 rows
se.head()

0    51
1    52
2    53
3    54
4    55
dtype: int64

In [ ]:
#print the last 5 rows
se.tail()

5    56
6    57
7    58
8    59
9    60
dtype: int64

In [ ]:
se[5] = 200   #Updating the value at index 5

In [ ]:
se

0     51
1     52
2     53
3     54
4     55
5    200
6     57
7     58
8     59
9     60
dtype: int64

In [ ]:
se[9] = 120

In [ ]:
se

 0     51
 1     52
 2     53
 3     54
 4     55
 5    200
 6     57
 7     58
 8     59
 9    120
-1    120
dtype: int64

In [ ]:
se = se.drop(se.index[-1])

In [ ]:
se

0     51
1     52
2     53
3     54
4     55
5    200
6     57
7     58
8     59
9    120
dtype: int64

In [ ]:
se.drop(se.index[0],inplace=True)

In [ ]:
se

1     52
2     53
3     54
4     55
5    200
6     57
7     58
8     59
9    120
dtype: int64

In [ ]:
se=pd.Series([51,52,53,54,55,56,57,58,59,60])
# print(se)
# print(se.head())#prints the first 5 elements
# print(se.tail())#prints the last 5 elements
se[5]=200
se[9]=120
# print(se)
se.drop(se.index[0],inplace=True)  #inplace=True changes my original data
se

1     52
2     53
3     54
4     55
5    200
6     57
7     58
8     59
9    120
dtype: int64

# From the above series. Find whether 200 exist or not in that particular series

In [ ]:
se

1     52
2     53
3     54
4     55
5    200
6     57
7     58
8     59
9    120
dtype: int64

In [ ]:
num = 20
num in se.values   #To check whether that number is present or not in our Series

False

In [ ]:
se.values

array([ 52,  53,  54,  55, 200,  57,  58,  59, 120])

## series_A = 10,20,30,40,50
## series_B = 'A','B','C','D','E'
## concatenate both the series

In [ ]:
series_A = pd.Series([10,20,30,40,50])
series_B = pd.Series(['A','B','C','D','E'])

In [ ]:
merged_sr = pd.concat([series_A,series_B],ignore_index=True)  #I want my new series to ignore the previous indexes
                                              #and I want it to create it's own indexes.

In [ ]:
merged_sr

0    10
1    20
2    30
3    40
4    50
5     A
6     B
7     C
8     D
9     E
dtype: object

In [ ]:
merged_sr

0    10
1    20
2    30
3    40
4    50
5     A
6     B
7     C
8     D
9     E
dtype: object

## Use for loop and print all the elements present inside your series

In [ ]:
for x in merged_sr:
  print(x)

10
20
30
40
50
A
B
C
D
E

## Nested List =[['AA','BB','CC'],['DD','EE','FF'],['GG','HH','II']
## Nested Dictionary = {
  'Kris':['Jordan',12,22],
  'Memphis':['Depay',23,24]
}

Convert this both into pandas dataframe

In [ ]:
Nested_List =[['AA','BB','CC'],['DD','EE','FF'],['GG','HH','II']]
Nested_List

[['AA', 'BB', 'CC'], ['DD', 'EE', 'FF'], ['GG', 'HH', 'II']]

In [ ]:
df = pd.DataFrame(Nested_List,columns=['alpha','beta','gama'])
df

  alpha beta gama
0    AA   BB   CC
1    DD   EE   FF
2    GG   HH   II

In [ ]:
Nested_Dictionary = {
'Kris':['Jordan',12,22], 'Memphis':['Depay',23,24] }

In [ ]:
data = pd.DataFrame(Nested_Dictionary)
data

     Kris Memphis
0  Jordan   Depay
1      12      23
2      22      24

In [ ]:
#Create a pandas dataframe with the columns= ['Name','Age']. Perform the following operations:
# Print the first 3 rows
#Print the rows where Age is greater than 15
#Insert 5 new names and age and merge it with your previous dataframe
#Update the 5th row with the name as 'John' and Age as 56
#delete the first row from the dataframe.

#HOMEWORK